# OverlappingElementsTest Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..OverlappingElementsTest Property
BuiltInFailures..::..OverlapFailures Class See Also
---
There are overlapping structural framing elements of the same type in the project found by Dynamic Update.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OverlappingElementsTest { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OverlappingElementsTest As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OverlappingElementsTest {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace